upload_performance_result/metrics/sglang/main-20260912-0019-34621342878-1/Nightly_Test_NPU/test_npu_qwen3_6_27b_1p_in1080p_30_out256_50ms__20260912.txt
memfabric_hybrid          1.1.4
sgl_kernel_npu            2026.9.0
sglang                    0.5.20.dev488+g12771786f       /sgl-workspace/sglang/python
sglang-router             0.3.2
torch                     2.10.0+cpu
torch_npu                 2.10.0
torchaudio                2.10.0+cpu
torchvision               0.25.0+cpu
CANN: 9.0.0
transformers: 5.12.1
/sgl-workspace/sglang/python/sglang/bench_serving.py:13: FutureWarning: `sglang.bench_serving` is deprecated and will be removed in a future release; use `sglang.benchmark.serving` instead (e.g. `python -m sglang.benchmark.serving`).
  warnings.warn(
/sgl-workspace/sglang/python/sglang/benchmark/datasets/image.py:58: UserWarning: High resolution (up to 1080x1920) with 152 total images may take a long time. Consider reducing resolution or image count.
  return sample_image_requests(
benchmark_args=Namespace(backend='sglang-oai-chat', base_url=None, host='127.0.0.1', port=20666, ready_check_timeout_sec=60, dataset_name='image', dataset_path='/tmp/ShareGPT_V3_unfiltered_cleaned_split.json', dataset_offset=0, agentic_max_turns=None, speed_bench_category=None, speed_bench_output_len=512, model='/root/.cache/modelscope/hub/models/Qwen/Qwen3.6-27B', served_model_name=None, tokenizer=None, num_prompts=152, sharegpt_output_len=None, sharegpt_context_len=None, random_input_len=30, random_output_len=256, random_range_ratio=1.0, image_count=1, image_resolution='1920x1080', random_image_count=False, image_format='jpeg', image_content='random', request_rate=inf, use_trace_timestamps=False, max_concurrency=42, output_file=None, output_details=False, print_requests=False, disable_tqdm=False, disable_stream=False, return_logprob=False, top_logprobs_num=0, token_ids_logprob=None, logprob_start_len=-1, return_routed_experts=False, cache_report=False, seed=1, disable_ignore_eos=False, temperature=0.0, top_p=1.0, extra_request_body=None, apply_chat_template=False, profile=False, plot_throughput=False, profile_activities=['CPU', 'GPU'], profile_start_step=None, profile_steps=None, profile_num_steps=None, profile_by_stage=False, profile_stages=None, profile_output_dir=None, profile_prefix=None, lora_name=None, lora_request_distribution='uniform', lora_zipf_alpha=1.5, prompt_suffix='', pd_separated=False, profile_prefill_url=None, profile_decode_url=None, flush_cache=False, flush_cache_timeout=60.0, warmup_requests=38, tokenize_prompt=False, gsp_num_groups=64, gsp_prompts_per_group=16, gsp_system_prompt_len=2048, gsp_question_len=128, gsp_output_len=256, gsp_range_ratio=1.0, gsp_fast_prepare=False, gsp_send_routing_key=False, gsp_num_turns=1, gsp_ordered=False, gsp_group_distribution='uniform', gsp_zipf_alpha=None, mooncake_slowdown_factor=1.0, mooncake_num_rounds=1, mooncake_workload='conversation', fake_prefill=False, tag=None, header=None)
Waiting up to 60s for http://127.0.0.1:20666/v1/models to become ready...
Server ready in 0.0s.
Namespace(backend='sglang-oai-chat', base_url=None, host='127.0.0.1', port=20666, ready_check_timeout_sec=60, dataset_name='image', dataset_path='/tmp/ShareGPT_V3_unfiltered_cleaned_split.json', dataset_offset=0, agentic_max_turns=None, speed_bench_category=None, speed_bench_output_len=512, model='/root/.cache/modelscope/hub/models/Qwen/Qwen3.6-27B', served_model_name=None, tokenizer=None, num_prompts=152, sharegpt_output_len=None, sharegpt_context_len=None, random_input_len=30, random_output_len=256, random_range_ratio=1.0, image_count=1, image_resolution='1920x1080', random_image_count=False, image_format='jpeg', image_content='random', request_rate=inf, use_trace_timestamps=False, max_concurrency=42, output_file=None, output_details=False, print_requests=False, disable_tqdm=False, disable_stream=False, return_logprob=False, top_logprobs_num=0, token_ids_logprob=None, logprob_start_len=-1, return_routed_experts=False, cache_report=False, seed=1, disable_ignore_eos=False, temperature=0.0, top_p=1.0, extra_request_body=None, apply_chat_template=True, profile=False, plot_throughput=False, profile_activities=['CPU', 'GPU'], profile_start_step=None, profile_steps=None, profile_num_steps=None, profile_by_stage=False, profile_stages=None, profile_output_dir=None, profile_prefix=None, lora_name=None, lora_request_distribution='uniform', lora_zipf_alpha=1.5, prompt_suffix='', pd_separated=False, profile_prefill_url=None, profile_decode_url=None, flush_cache=False, flush_cache_timeout=60.0, warmup_requests=38, tokenize_prompt=False, gsp_num_groups=64, gsp_prompts_per_group=16, gsp_system_prompt_len=2048, gsp_question_len=128, gsp_output_len=256, gsp_range_ratio=1.0, gsp_fast_prepare=False, gsp_send_routing_key=False, gsp_num_turns=1, gsp_ordered=False, gsp_group_distribution='uniform', gsp_zipf_alpha=None, mooncake_slowdown_factor=1.0, mooncake_num_rounds=1, mooncake_workload='conversation', fake_prefill=False, tag=None, header=None)

#Input tokens: 316735
#Output tokens: 38912
#Total images: 152
#Images per request: 1 (fixed)

=== Token Breakdown (per request avg / total) ===
  Raw text prompt tokens (without overhead): avg=30.0, total=4560
  Text prompt tokens (with chat template): avg=42.3, total=6426
  Text prompt overhead: avg=12.3, total=1866
  Vision tokens: avg=2041.5, total=310309

Created 152 random jpeg images with average 2090340 bytes per request
Starting warmup with 38 sequences...
Warmup completed with 38 sequences. Starting main benchmark run...

  0%|          | 0/152 [00:00<?, ?it/s]
  1%|          | 1/152 [00:25<1:05:00, 25.83s/it]
  1%|▏         | 2/152 [00:25<26:45, 10.70s/it]  
  3%|▎         | 5/152 [00:26<07:34,  3.09s/it]
  7%|▋         | 11/152 [00:27<02:44,  1.17s/it]
 17%|█▋        | 26/152 [00:27<00:46,  2.73it/s]
 19%|█▉        | 29/152 [00:28<00:42,  2.90it/s]
 20%|█▉        | 30/152 [00:40<00:42,  2.90it/s]
 20%|██        | 31/152 [00:41<02:23,  1.18s/it]
 21%|██        | 32/152 [00:42<02:15,  1.13s/it]
 22%|██▏       | 33/152 [00:42<02:04,  1.04s/it]
 23%|██▎       | 35/152 [00:42<01:36,  1.21it/s]
 24%|██▍       | 37/152 [00:43<01:13,  1.57it/s]
 25%|██▌       | 38/152 [00:43<01:13,  1.55it/s]
 26%|██▌       | 39/152 [00:47<02:23,  1.27s/it]
 27%|██▋       | 41/152 [00:47<01:35,  1.16it/s]
 28%|██▊       | 43/152 [00:48<01:05,  1.66it/s]
 30%|██▉       | 45/152 [00:48<00:46,  2.30it/s]
 33%|███▎      | 50/152 [00:48<00:24,  4.20it/s]
 35%|███▍      | 53/152 [00:48<00:18,  5.39it/s]
 36%|███▌      | 55/152 [00:48<00:15,  6.09it/s]
 38%|███▊      | 57/152 [00:49<00:13,  7.14it/s]
 39%|███▉      | 59/152 [00:49<00:11,  8.15it/s]
 41%|████      | 62/152 [01:00<00:11,  8.15it/s]
 41%|████▏     | 63/152 [01:06<02:47,  1.89s/it]
 42%|████▏     | 64/152 [01:06<02:29,  1.70s/it]
 43%|████▎     | 65/152 [01:07<02:09,  1.49s/it]
 43%|████▎     | 66/152 [01:07<01:57,  1.36s/it]
 45%|████▍     | 68/152 [01:08<01:17,  1.08it/s]
 45%|████▌     | 69/152 [01:12<02:15,  1.63s/it]
 47%|████▋     | 71/152 [01:12<01:28,  1.09s/it]
 49%|████▉     | 75/152 [01:13<00:42,  1.82it/s]
 52%|█████▏    | 79/152 [01:13<00:26,  2.73it/s]
 56%|█████▌    | 85/152 [01:13<00:14,  4.47it/s]
 58%|█████▊    | 88/152 [01:14<00:11,  5.42it/s]
 60%|█████▉    | 91/152 [01:14<00:10,  5.80it/s]
 61%|██████    | 93/152 [01:14<00:09,  6.54it/s]
 62%|██████▎   | 95/152 [01:28<01:35,  1.68s/it]
 63%|██████▎   | 96/152 [01:29<01:25,  1.53s/it]
 64%|██████▍   | 98/152 [01:29<01:00,  1.11s/it]
 66%|██████▌   | 100/152 [01:33<01:12,  1.39s/it]
 66%|██████▋   | 101/152 [01:33<01:02,  1.22s/it]
 68%|██████▊   | 103/152 [01:34<00:41,  1.17it/s]
 69%|██████▉   | 105/152 [01:34<00:28,  1.63it/s]
 70%|██████▉   | 106/152 [01:34<00:24,  1.89it/s]
 72%|███████▏  | 109/152 [01:34<00:14,  3.06it/s]
 75%|███████▌  | 114/152 [01:34<00:06,  5.70it/s]
 79%|███████▉  | 120/152 [01:34<00:03,  9.46it/s]
 81%|████████  | 123/152 [01:35<00:02, 10.29it/s]
 83%|████████▎ | 126/152 [01:44<00:23,  1.13it/s]
 84%|████████▍ | 128/152 [01:45<00:18,  1.27it/s]
 86%|████████▌ | 130/152 [01:45<00:15,  1.46it/s]
 86%|████████▌ | 131/152 [01:49<00:23,  1.12s/it]
 87%|████████▋ | 132/152 [01:49<00:19,  1.04it/s]
 88%|████████▊ | 134/152 [01:49<00:12,  1.49it/s]
 89%|████████▉ | 135/152 [01:50<00:09,  1.75it/s]
 91%|█████████ | 138/152 [01:50<00:04,  2.97it/s]
 93%|█████████▎| 142/152 [01:50<00:01,  5.10it/s]
 95%|█████████▌| 145/152 [01:50<00:01,  6.88it/s]
 97%|█████████▋| 148/152 [01:51<00:00,  5.54it/s]
 99%|█████████▊| 150/152 [01:51<00:00,  6.35it/s]
100%|██████████| 152/152 [01:51<00:00,  6.53it/s]
100%|██████████| 152/152 [01:51<00:00,  1.36it/s]

============ Serving Benchmark Result ============
Backend:                                 sglang-oai-chat
Traffic request rate:                    inf       
Max request concurrency:                 42        
Successful requests:                     152       
Benchmark duration (s):                  111.70    
Total input tokens:                      316735    
Total input text tokens:                 6426      
Total input vision tokens:               310309    
Total generated tokens:                  38912     
Total generated tokens (retokenized):    38590     
Request throughput (req/s):              1.36      
Input token throughput (tok/s):          2835.55   
Output token throughput (tok/s):         348.36    
Peak output token throughput (tok/s):    437.00    
Peak concurrent requests:                59        
Total token throughput (tok/s):          3183.91   
Concurrency:                             39.24     
Accept length:                           2.82      
----------------End-to-End Latency----------------
Mean E2E Latency (ms):                   28833.65  
Median E2E Latency (ms):                 26188.53  
P90 E2E Latency (ms):                    43626.04  
P95 E2E Latency (ms):                    46279.78  
P99 E2E Latency (ms):                    51867.93  
---------------Time to First Token----------------
Mean TTFT (ms):                          18945.34  
Median TTFT (ms):                        18330.99  
P90 TTFT (ms):                           29871.64  
P95 TTFT (ms):                           38276.52  
P99 TTFT (ms):                           41638.31  
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          38.78     
Median TPOT (ms):                        28.46     
P90 TPOT (ms):                           88.86     
P95 TPOT (ms):                           95.56     
P99 TPOT (ms):                           103.32    
---------------Inter-Token Latency----------------
Mean ITL (ms):                           39.00     
Median ITL (ms):                         22.70     
P90 ITL (ms):                            47.13     
P95 ITL (ms):                            73.85     
P99 ITL (ms):                            104.68    
Max ITL (ms):                            16955.59  
==================================================

# [collect_metrics] 文件原始修改时间: 2026-09-12 01:04:43
# [collect_metrics] 源目录日期: 20260912
# [collect_metrics] CI运行目录: nightly-perf-2-npu-a3/test_npu_qwen3_6_27b_1p_in1080p_30_out256_50ms